I'm still unable to reproduce this issue with the following:

- [x] Terraform: `v1.9.5`, `v1.9.8`, and `v1.11.4` (`windows_amd64`)
- [x] Provider: `v2.8.3`, `v2.12.0`, and `main`.
- [x] vSphere: `8.0.3.00300`
- [x] Editor: VSCode and Notepad

```shell
PS F:\Code\test> terraform apply --auto-approve  
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vsphere in C:\Users\Administrator\go\bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become
│ incompatible with published releases.
╵
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_virtual_machine.template: Reading...
data.vsphere_datastore_cluster.datastore_cluster: Reading...
data.vsphere_network.network: Reading...
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_network.network: Read complete after 0s [id=dvportgroup-8014]
data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c9]
data.vsphere_virtual_machine.template: Read complete after 1s [id=421f22cb-046b-7ff7-9fd8-b0a266595003]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_datastore_cluster.datastore_cluster: Read complete after 0s [id=group-p8013]
data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-10]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_cluster_id                    = "group-p8013"
      + datastore_id                            = (known after apply)
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = true
      + ept_rvi_mode                            = (known after apply)
      + extra_config_reboot_required            = true
      + firmware                                = "efi"
      + folder                                  = "workloads"
      + force_power_off                         = true
      + guest_id                                = "vmwarePhoton64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = (known after apply)
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 1024
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "photon-test"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 1
      + nvme_controller_count                   = 0
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-10"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "421f22cb-046b-7ff7-9fd8-b0a266595003"
          + timeout       = 30
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 16
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-8014"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.vm: Creating...
vsphere_virtual_machine.vm: Still creating... [11s elapsed]
vsphere_virtual_machine.vm: Still creating... [21s elapsed]
vsphere_virtual_machine.vm: Still creating... [31s elapsed]
vsphere_virtual_machine.vm: Still creating... [41s elapsed]
vsphere_virtual_machine.vm: Still creating... [51s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m1s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m11s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m21s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m31s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m41s elapsed]
vsphere_virtual_machine.vm: Still creating... [1m51s elapsed]
vsphere_virtual_machine.vm: Creation complete after 1m57s [id=421fd563-f297-47b4-7524-809c000a90d6]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
PS F:\Code\test> terraform apply --auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vsphere in C:\Users\Administrator\go\bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become  
│ incompatible with published releases.
╵
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_network.network: Reading...
data.vsphere_datastore_cluster.datastore_cluster: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_network.network: Read complete after 0s [id=dvportgroup-8014]
data.vsphere_compute_cluster.cluster: Read complete after 1s [id=domain-c9]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_virtual_machine.template: Read complete after 1s [id=421f22cb-046b-7ff7-9fd8-b0a266595003]
data.vsphere_datastore_cluster.datastore_cluster: Read complete after 1s [id=group-p8013]
data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-10]
vsphere_virtual_machine.vm: Refreshing state... [id=421fd563-f297-47b4-7524-809c000a90d6]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be updated in-place
  ~ resource "vsphere_virtual_machine" "vm" {
      + annotation                              = <<-EOT
            my multi-line
            awesome

            annotation
        EOT
        id                                      = "421fd563-f297-47b4-7524-809c000a90d6"
        name                                    = "photon-test"
        tags                                    = []
        # (74 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
vsphere_virtual_machine.vm: Modifying... [id=421fd563-f297-47b4-7524-809c000a90d6]
vsphere_virtual_machine.vm: Still modifying... [id=421fd563-f297-47b4-7524-809c000a90d6, 10s elapsed]
vsphere_virtual_machine.vm: Modifications complete after 11s [id=421fd563-f297-47b4-7524-809c000a90d6]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
PS F:\Code\test> terraform apply --auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vsphere in C:\Users\Administrator\go\bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become  
│ incompatible with published releases.
╵
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_network.network: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_datastore_cluster.datastore_cluster: Reading...
data.vsphere_network.network: Read complete after 0s [id=dvportgroup-8014]
data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c9]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_datastore_cluster.datastore_cluster: Read complete after 1s [id=group-p8013]
data.vsphere_virtual_machine.template: Read complete after 1s [id=421f22cb-046b-7ff7-9fd8-b0a266595003]
data.vsphere_resource_pool.pool: Read complete after 1s [id=resgroup-10]
vsphere_virtual_machine.vm: Refreshing state... [id=421fd563-f297-47b4-7524-809c000a90d6]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
PS F:\Code\test> terraform apply --auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/vsphere in C:\Users\Administrator\go\bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become  
│ incompatible with published releases.
╵
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_network.network: Reading...
data.vsphere_datastore_cluster.datastore_cluster: Reading...
data.vsphere_network.network: Read complete after 0s [id=dvportgroup-8014]
data.vsphere_compute_cluster.cluster: Read complete after 1s [id=domain-c9]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_virtual_machine.template: Read complete after 1s [id=421f22cb-046b-7ff7-9fd8-b0a266595003]
data.vsphere_datastore_cluster.datastore_cluster: Read complete after 1s [id=group-p8013]
data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-10]
vsphere_virtual_machine.vm: Refreshing state... [id=421fd563-f297-47b4-7524-809c000a90d6]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
PS F:\Code\test> 
```